/*
문제 설명
    시간 제한 / 메모리 제한
        10초 / 2GB
    
    문제 설명
        0 이상의 정수로 이루어진 배열 arr 이 주어집니다. 당신은 arr과 길이가 같으며 모든 원소가 0으 로 이루어진 배열 A를 다음 작업을 통해 arr과 같게 만들려고 합니다.
        인덱스 i부터 j까지의 구간에 속하는 모든 원소에 임의의 양의 정수 value를 더합니다.
        0≤i≤j<A의 길이
    예를 들어 arr 이 [1, 2, 4, 8, 4, 2, 1] 일 때, 다음 과정을 통해 A를 arr과 같게 만들 수 있습니다.
    i  j value A
    - - - [0, 0, 0, 0, 0, 0, 0]
    0 6 1 [1, 1, 1, 1, 1, 1, 1]
    1 5 1 [1, 2, 2, 2, 2, 2, 1]
    2 4 2 [1, 2, 4, 4, 4, 2, 1]
    3 3 4 [1, 2, 4, 8, 4, 2, 1]

    위와 같이, A를 arr과 같게 만들려면 최소 4번의 작업이 필요하며, 이보다 적은 횟수로 작업을 마칠 수 없습니다.
    정수 배열 arr 이 매개변수로 주어질 때, 0으로 이루어진 배열을 arr과 같은 배열로 만들기 위해 필요한 최소 작업 횟수를 return 하도록 solution 함수를 완성해주세요.
    
    제한사항
        1≤ arr의 길이 ≤ 500,000
        0 ≤ arr 의 원소 ≤ 1,000,000,000
    
    1. 모노 스택을 이용하여 양의 정수 더하기

    2. 현재 스택값보다 클 경우 새로운 횟수이므로 스택에 쌓는다.

    3. 현재 스택값보다 작을 경우 == 스택에 넣을때, 이미 쌓는 카운트를 넣었으므로, 스택 제거, 연산 포함 x

    4. h == 0 일 경우, 이전 쌓은 넣은 것들 제거 + 새로운 작업 준비 
*/
#include<bits/stdc++.h>
using namespace std;

int n;
int h;
stack<int> st;
int ans;

int main(void) {
    
    cin >> n;

    
    for(int i = 0; i < n ; i ++){
        cin >> h;
        while(!st.empty() && st.top() > h) st.pop();

        if(h ==0) continue;
        if (st.empty() || st.top() < h) {
            st.push(h); ans++;
        }
    }

    
    cout << ans ;
    return 0;
}
